<template>
<!--所有产品展示页-->
    <div class="home_content">
      <div class="container">
        <div class="page_top text_select_no">
          <div class="formBox">
            <span class="input_label">产品名称</span>
            <input class="input" type="text"/>
            <span class="input_label">产品类型</span>
            <button class="input button" @click="showDrop">
              <span class="input_inner">{{select}}</span>
              <p class="input_tri"></p>
              <div class="drop_content" v-show="dropShow">
                <ul class="drop_inner">
                  <li v-for="(item,index) in dataList" :kry="index" @click="selectItem(item)">{{item}}</li>
                </ul>
              </div>
            </button>
            <p class="btn search" v-waves>查询</p>
            <p class="btn reset" v-waves>重置</p>
          </div>
          <div class="formBox">
            <span class="input_label">产品状态</span>
            <input type="checkbox" class="input" value="销售中">
            <span class="input_label">销售中</span>
            <input type="checkbox" class="input" value="停售中">
            <span class="input_label">停售中</span>
            <input type="checkbox" class="input" value="促销中">
            <span class="input_label" style="margin-right: 20px">促销中</span>
            <span class="input_label">金额</span>
            <input class="input input_number" type="number" placeholder="最低价"/>
            <p class="split">—</p>
            <input class="input input_number" type="number" placeholder="最高价"/>
          </div>
          <div class="formBox">
            <div class="btn add" v-waves>添加一件产品</div>
            <div class="btn click" v-waves>刷新产品列表</div>
          </div>
        </div>
        <div class="data_count">
          <svg t="1631437410441" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1013" width="18" height="18"><path d="M949.59255638 912.58309442l-258.55141893-258.55141891c27.85719934-30.08806335 50.02283537-64.40904818 66.01069413-102.1621315 18.47613014-43.58765071 27.79999771-89.89237941 27.7999977-137.59854826s-9.32386754-93.98229675-27.7999977-137.59854829c-17.78971047-42.10040802-43.27304172-79.88209216-75.70637235-112.34402365-32.46193148-32.46193148-70.24361557-57.91666189-112.3440236-75.73497313-43.61625155-18.44752934-89.92098021-27.79999771-137.62714913-27.7999977-47.67756807 0-93.98229675 9.35246835-137.59854827 27.7999977-42.10040802 17.78971047-79.88209216 43.27304172-112.31542283 75.70637231-32.46193148 32.46193148-57.91666189 70.24361557-75.73497314 112.34402364-18.44752934 43.58765071-27.79999771 89.89237941-27.79999771 137.5985483s9.35246835 93.98229675 27.79999771 137.59854827c17.81831127 42.07180724 43.27304172 79.85349134 75.73497314 112.31542283 32.43333065 32.46193148 70.24361557 57.91666189 112.31542283 75.70637234 43.58765071 18.47613014 89.89237941 27.79999771 137.59854827 27.79999768 47.70616887 0 94.01089758-9.32386754 137.62714913-27.79999768 23.9388869-10.12469051 46.47633361-22.73765244 67.44073514-37.69588168l261.78331167 261.78331169c7.09300353 7.09300353 16.38827025 10.63950529 25.65493617 10.63950528 9.32386754 0 18.59053345-3.54650176 25.68353694-10.63950528C963.77856345 949.79276213 963.77856345 926.79770231 949.59255638 912.58309442L949.59255638 912.58309442zM431.3742865 695.01665153c-154.81624235 0-280.74565578-125.95801426-280.74565577-280.74565578 0-154.81624235 125.92941344-280.7742566 280.74565577-280.77425661 154.84484316 0 280.80285742 125.95801426 280.80285744 280.77425661C712.17714394 569.05863726 586.21912966 695.01665153 431.3742865 695.01665153L431.3742865 695.01665153zM431.3742865 695.01665153" p-id="1014" fill="#ff7874"></path></svg>
          <span class="input_label" style="margin-left: 20px">查看合计</span>
          <span class="input_label">产品总数:</span>
          <span class="num">{{total}}</span>
          <span class="input_label">件</span>
        </div>
        <xm-table :title="tableTitle"
                  :dataList="tableData"
                  :state="tableState"
                  :stateIndex="5"
                  :detail='true'
                  :sort='true'
                  :path="detailPath"
                  img=""
        />
      </div>
    </div>
</template>

<script>
  import xmTable from '../../views/xm-table'
  export default {
    name: 'productPage',
    components:{
      xmTable
    },
    data(){
      return{
        dataList:[
          "全部",
          "手机 电话卡",
          "电视 盒子",
          "笔记本 显示器 平板",
          "家电 插线板",
          "出行 穿戴",
          "智能 路由器",
          "电源 配件",
          "健康 儿童",
          "耳机 音箱",
          "生活 箱包",
        ],
        select:'全部',
        dropShow:false,
        tableTitle:['产品名称','产品标题','原价','促销价','创建时间','上架状态'],
        tableData:[
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','1~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','2~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','3~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','4~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','5~~','119.0','79.0','2018-04-24 10:36:23','停售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','6~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','7~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','8~~','119.0','79.0','2018-04-24 10:36:23','促销中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','9~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','10~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','11~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','12~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','13~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','14~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','15~~','119.0','79.0','2018-04-24 10:36:23','停售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','16~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','17~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','18~~','119.0','79.0','2018-04-24 10:36:23','促销中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','19~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','20~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','21~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','22~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','23~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','24~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','25~~','119.0','79.0','2018-04-24 10:36:23','停售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','26~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','27~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','28~~','119.0','79.0','2018-04-24 10:36:23','促销中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','29~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','30~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','31~~','119.0','79.0','2018-04-24 10:36:23','停售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','32~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','33~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','34~~','119.0','79.0','2018-04-24 10:36:23','促销中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','35~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
          ['2018春装新款韩版潮学生宽松薄款卫衣女长袖ins超火的上衣服外套','36~~','119.0','79.0','2018-04-24 10:36:23','销售中'],
        ],
        tableState:[
          {
            type:'销售中',
            color:'#8BB979',
          },
          {
            type:'停售中',
            color:'#ccc',
          },
          {
            type:'促销中',
            color:'#f9B689',
          }],
        detailPath: '/productDetail',
      }
    },
    computed:{
      total(){
        return this.tableData.length
      }
    },
    methods:{
      selectItem(item){
        this.select = item
      },
      showDrop(){
        this.dropShow = !this.dropShow
      }
    },
  }
</script>

<style scoped>
</style>
